{
  "backend/main.mo": "Minimal Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of main frontend components, views, hooks, and config files.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens and light/dark theme color variables.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling navigation between welcome, quiz, results, and celebration views.",
  "frontend/src/components/AudioToggle.tsx": "Floating audio toggle button that mutes or unmutes using the useAudio hook.",
  "frontend/src/components/ConfettiHeartsBurst.tsx": "Emoji-based confetti animation component supporting burst and continuous modes.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "Animated pastel background with floating heart graphics and randomized heart elements.",
  "frontend/src/components/QuestionCard.tsx": "Renders a single quiz question with selectable options and visual feedback on answer.",
  "frontend/src/components/QuizFlow.tsx": "Quiz controller managing questions, progress, scoring, and triggering confetti on correct answers.",
  "frontend/src/components/ValentineLayout.tsx": "App layout wrapper providing background, audio toggle, and footer around all screens.",
  "frontend/src/data/valentineQuizQuestions.ts": "Defines the five quiz questions, choices, and correct answer indices.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing an authenticated or anonymous backend actor using React Query.",
  "frontend/src/hooks/useAudio.ts": "Provides a Zustand-powered audio mute state and utility functions to play simple tones and celebration sounds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity login, identity loading, and auth state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing for future query logic.",
  "frontend/src/index.css": "Tailwind base styles with custom romantic color variables, animations, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/views/CelebrationScreen.tsx": "Displays a celebration screen with animations and triggers a celebration sound effect.",
  "frontend/src/views/NonPerfectResultScreen.tsx": "Shows a teasing result screen where repeated 'No' clicks shrink the button and change prompts.",
  "frontend/src/views/PerfectResultScreen.tsx": "Renders a perfect-score reward screen with an image and a redeemable date coupon interaction.",
  "frontend/src/views/WelcomeScreen.tsx": "Initial welcome screen prompting the user to start the quiz with themed visuals.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom romantic colors, typography, animations, and container settings.",
  "project_state.json": "Defines the project’s current build plan for a Valentine-themed interactive quiz web app, including visual style, quiz flow, required images, and existing implemented features. Contains architectural notes, no known issues, and structured feature metadata for quiz screens and logic."
}