{
  "backend/main.mo": "Empty Motoko actor placeholder without logic.",
  "feature_evidence.json": "Feature-evidence metadata linking quiz flow and score computation changes to specific frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend component and config file.",
  "frontend/index.css": "Global Tailwind layers defining custom Valentine-themed CSS variables and base styles.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level component controlling navigation between welcome, quiz, result, and celebration views.",
  "frontend/src/components/AudioToggle.tsx": "UI button toggling global audio state using the useAudio hook.",
  "frontend/src/components/ConfettiHeartsBurst.tsx": "Generates falling heart/confetti particles with optional continuous mode.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "Renders animated gradient and floating heart visuals for the app background.",
  "frontend/src/components/QuestionCard.tsx": "Displays a single quiz question and handles option selection with state reset on question change.",
  "frontend/src/components/QuizFlow.tsx": "Manages quiz progression, score updates, correct-answer celebrations, and calls onComplete at the end.",
  "frontend/src/components/ValentineLayout.tsx": "Wraps all screens with themed background, audio toggle, and footer.",
  "frontend/src/data/valentineQuizQuestions.ts": "Exports the array of five quiz questions with options and correct answers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useAudio.ts": "Provides a Zustand-backed audio mute state and functions to play simple oscillator-based sounds for feedback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context with login, logout, and identity loading via Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder export indicating no backend queries are used.",
  "frontend/src/index.css": "Defines Tailwind layers and a pastel romantic theme with custom colors, animations, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/views/CelebrationScreen.tsx": "Displays a celebratory screen with heart animations and plays a celebration sound.",
  "frontend/src/views/NonPerfectResultScreen.tsx": "Shows a teasing result screen where the 'No' button shrinks on repeated clicks and prompts the user to accept.",
  "frontend/src/views/PerfectResultScreen.tsx": "Displays a perfect-score screen with celebratory visuals and a redeemable date coupon interaction.",
  "frontend/src/views/WelcomeScreen.tsx": "Renders the opening screen inviting the user to start the quiz.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom romantic color variables, extended theme options, and additional plugins.",
  "project_state.json": "Defines project metadata for a Valentine-themed interactive quiz app, including UI/UX requirements, quiz content, and known issues. Indicates a fix request for a quiz flow bug and lists existing implemented features."
}