{
  "kind": "build_request",
  "title": "Fix quiz flow getting stuck after the second question",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Fix the quiz flow so it always advances from Question 2 to Question 3 (and continues through Question 5) after the user selects an option, without getting stuck or leaving the UI in a disabled state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "It's not moving after second question"
        ]
      },
      "acceptanceCriteria": [
        "From a fresh load, selecting any option on Question 1 advances to Question 2 after the existing delay/animation behavior.",
        "Selecting any option on Question 2 advances to Question 3 after the existing delay/animation behavior.",
        "On each newly displayed question, the answer options are enabled/clickable (not permanently disabled from the previous question).",
        "The user can complete all 5 questions in sequence without needing to refresh the page."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Correct any state/score computation issues in the quiz controller so the final score passed to the results routing is accurate regardless of timing (e.g., correct answers that trigger celebration delays).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "It's not moving after second question"
        ]
      },
      "acceptanceCriteria": [
        "Completing the quiz with 5 correct answers results in the perfect-score (5/5) results path.",
        "Completing the quiz with fewer than 5 correct answers results in the non-perfect results path.",
        "The score displayed/used at completion matches the number of questions answered correctly (no off-by-one errors due to animation/timeout state)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the backend as a single Motoko actor; do not introduce additional backend services.",
    "Use English for any user-facing text introduced as part of this fix."
  ],
  "nonGoals": [
    "Adding new quiz questions or changing the existing questions/options/correct answers.",
    "Adding authentication or requiring login.",
    "Redesigning the app’s visual theme beyond what is necessary to fix the quiz navigation bug."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}