{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix quiz progression + scoring race conditions in QuizFlow",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Ensure the quiz always advances past Question 2 and each new question renders with enabled/clickable options (no stuck/disabled UI).",
      "acceptanceCriteria": [
        "From a fresh load, selecting any option on Question 1 advances to Question 2 after the existing delay/animation behavior.",
        "Selecting any option on Question 2 advances to Question 3 after the existing delay/animation behavior.",
        "On each newly displayed question, the answer options are enabled/clickable (not permanently disabled from the previous question).",
        "The user can complete all 5 questions in sequence without needing to refresh the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/QuizFlow.tsx",
          "operation": "modify",
          "description": "Fix progression state updates to avoid stale closures (use functional state updates for question index advancement) and ensure the QuestionCard is reset between questions (e.g., by supplying a stable key based on the currentQuestionIndex). Continue using the shadcn-ui Progress component for the progress bar; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/QuestionCard.tsx",
          "operation": "modify",
          "description": "Reset per-question local state (selectedIndex/hasAnswered) when the incoming question changes so options are re-enabled for each new question, preventing the UI from staying disabled. Continue using the shadcn-ui Card and Button components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Make quiz score computation deterministic so the final score used for results routing is always correct regardless of animation/timeout timing.",
      "acceptanceCriteria": [
        "Completing the quiz with 5 correct answers results in the perfect-score (5/5) results path.",
        "Completing the quiz with fewer than 5 correct answers results in the non-perfect results path.",
        "The score displayed/used at completion matches the number of questions answered correctly (no off-by-one errors due to animation/timeout state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/QuizFlow.tsx",
          "operation": "modify",
          "description": "Eliminate timing-dependent score calculation by deriving the next score at answer time (and/or using functional setScore with a synchronized source of truth) and invoking onComplete with the correct final score on the last question, independent of celebration delays/timeouts. Keep existing animation delays behavior intact."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify results routing logic remains consistent with the corrected finalScore passed from QuizFlow (perfect vs non-perfect view selection) and ensure the score state updates correctly when the quiz completes."
        }
      ]
    }
  ]
}